---
kind: method
id: M:Autodesk.Revit.DB.NumberingSchemaType.op_Inequality(Autodesk.Revit.DB.NumberingSchemaType,Autodesk.Revit.DB.NumberingSchemaType)
source: html/d826dd1f-8550-cf0c-d2e6-ac3a6e93d4d2.htm
---
# Autodesk.Revit.DB.NumberingSchemaType.op_Inequality Method

Compares two NumberingSchemaType instances.

## Syntax (C#)
```csharp
public static bool operator !=(
	NumberingSchemaType first,
	NumberingSchemaType second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.NumberingSchemaType`) - The first NumberingSchemaType.
- **second** (`Autodesk.Revit.DB.NumberingSchemaType`) - The second NumberingSchemaType.

## Returns
True if the inputs are different, false if they are identical.